[
  {
    "name": "Amazon Web Services (AWS)",
    "description": "Our team brings extensive executive leadership experience from Amazon Web Services (AWS) startups and venture capital teams. As Sales and Solutions Architecture leaders, we had the opportunity to spend years in the field with thousands of artificial intelligence, fintech, healthcare & life sciences, generative AI, and web3/blockchain businesses. Over the years, we witnessed firsthand the challenges businesses faced as they embarked on their cloud journey. We saw what works, and more importantly, what does not work – and we strive to pass these learnings on to every portfolio company and investor that we partner with."
  },
  {
    "name": "Google Cloud Platform (GCP)",
    "description": "Before founding Songster Capital, our leadership team had the opportunity to partner with world-class venture firms while serving on Google Cloud’s Venture Capital and Private Equity team. Our management team has worked shoulder-to-shoulder with Andreessen Horowitz, Sequoia Capital, Lightspeed Venture Partners, and Google Ventures to identify, grow, and scale startups with hyper-growth potential. Throughout this time, we acquired proprietary experience building cutting-edge technologies and have developed lasting relationships with investment partners and cross functional Google leadership teams."
  },
  {
    "name": "Early to Later-Stage AI Startups",
    "description": "One of our competitive advantages is our extensive operator experience. We have built companies from the ground up, from inception to the first enterprise deal; from first check to Series A, Series B, and beyond. We've built through times of expansion and contraction, shared spectacular victories, and endured vicious losses. We have witnessed extravagant management teams excessively burn through capital during the good times and lay off hundreds of employees as a result during the bad times. We use these experiences to our advantage and bring a sense of urgency, tenacity, and grit to every business we invest in."
  }
]
